*Pusher: @cobusbernard, Action: `pull_request`*

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cobusbernard/GitHub-Africa-Meetup-Dev/runs/run-5EsvSkHiceM6L5kV

Waiting for the plan to start...

Terraform v0.13.2
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05438daa3957a7ac2]
aws_s3_bucket.user_data: Refreshing state... [id=github-africa-meetup-dev]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0dd4e1d80d162a02c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-03336bda218a82e27]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-051de2ee2b490202c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05ebdca4ad10996a5]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f4e90664ea0ea808]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ab4222bd050ebdcc]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-012bc742ee087352d]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0e1f287d9795eabad]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-000f3d3cb1c3d8c0d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f53053a16b8279ba]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-051073b6baa161b8e]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-051de2ee2b490202c1080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-07d2882a8fb16d4dd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d2b30ced513627af]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04a0a48b3d689978b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bf89a3680e50ed68]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-062346fafe66b169e]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09bd618b40e603e90]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.s3_full will be created
  + resource "aws_iam_policy" "s3_full" {
      + arn         = (known after apply)
      + description = "S3 Full access policy"
      + id          = (known after apply)
      + name        = "s3_full_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::github-africa-meetup-dev",
                          + "arn:aws:s3:::github-africa-meetup-dev/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.s3_readonly will be created
  + resource "aws_iam_policy" "s3_readonly" {
      + arn         = (known after apply)
      + description = "S3 Readonly access policy"
      + id          = (known after apply)
      + name        = "s3_readonly_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:Get*",
                          + "s3:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::github-africa-meetup-dev",
                          + "arn:aws:s3:::github-africa-meetup-dev/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.developers will be created
  + resource "aws_iam_role" "developers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {}
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::<id>:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "developers"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.developer_dev_s3_full[0] will be created
  + resource "aws_iam_role_policy_attachment" "developer_dev_s3_full" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "developers"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

</details>